Revit 2026 API

# XYZNegate Method

---

Negates this vector.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public XYZ Negate()
```
```vb
Public Function Negate As XYZ
```
```cpp
public:
XYZ^ Negate()
```
```fsharp
member Negate : unit -> XYZ
```

#### Return Value

XYZThe vector opposite to this vector.

The negated vector is obtained by changing the sign of each coordinate of this vector.

#### Reference

XYZ Class

Autodesk.Revit.DB Namespace